<a href="https://colab.research.google.com/github/savika10/ML--classification/blob/master/Marketing_campaign_for_Banking_products.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#importing libraries
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
sns.set(color_codes=True)
%matplotlib inline

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [2]:
#import the dataset
dataset=pd.read_excel('Bank_Personal_Loan_Modelling.xlsx',sheet_name="Data")
df=pd.DataFrame(dataset)
print(df.dtypes)

ID                      int64
Age                     int64
Experience              int64
Income                  int64
ZIP Code                int64
Family                  int64
CCAvg                 float64
Education               int64
Mortgage                int64
Personal Loan           int64
Securities Account      int64
CD Account              int64
Online                  int64
CreditCard              int64
dtype: object

In [ ]:
dataset.head()

   ID  Age  Experience  ...  CD Account  Online  CreditCard
0   1   25           1  ...           0       0           0
1   2   45          19  ...           0       0           0
2   3   39          15  ...           0       0           0
3   4   35           9  ...           0       0           0
4   5   35           8  ...           0       0           1

[5 rows x 14 columns]

In [ ]:
dataset.tail()

        ID  Age  Experience  ...  CD Account  Online  CreditCard
4995  4996   29           3  ...           0       1           0
4996  4997   30           4  ...           0       1           0
4997  4998   63          39  ...           0       0           0
4998  4999   65          40  ...           0       1           0
4999  5000   28           4  ...           0       1           1

[5 rows x 14 columns]

In [ ]:
dataset.sample(5)

        ID  Age  Experience  ...  CD Account  Online  CreditCard
2061  2062   63          38  ...           0       0           0
3982  3983   24           0  ...           0       1           0
2706  2707   43          17  ...           0       1           0
4035  4036   34           9  ...           1       1           0
3803  3804   42          18  ...           0       1           0

[5 rows x 14 columns]

In [ ]:
dataset.mean()

ID                     2500.500000
Age                      45.338400
Experience               20.104600
Income                   73.774200
ZIP Code              93152.503000
Family                    2.396400
CCAvg                     1.937913
Education                 1.881000
Mortgage                 56.498800
Personal Loan             0.096000
Securities Account        0.104400
CD Account                0.060400
Online                    0.596800
CreditCard                0.294000
dtype: float64

In [ ]:
dataset.mean().shape

(14,)

In [ ]:
dataset.shape

(5000, 14)

In [ ]:
dataset.mean(axis=1)

0       6513.614286
1       6442.535714
2       6770.785714
3       6733.264286
4       6530.785714
           ...
4995    6983.707143
4996    6941.028571
4997    7010.878571
4998    6799.535714
4999    6980.985714
Length: 5000, dtype: float64

In [ ]:
dataset.mean(axis=0)

ID                     2500.500000
Age                      45.338400
Experience               20.104600
Income                   73.774200
ZIP Code              93152.503000
Family                    2.396400
CCAvg                     1.937913
Education                 1.881000
Mortgage                 56.498800
Personal Loan             0.096000
Securities Account        0.104400
CD Account                0.060400
Online                    0.596800
CreditCard                0.294000
dtype: float64

In [ ]:
dataset.index

RangeIndex(start=0, stop=5000, step=1)

In [ ]:
dataset.groupby('Personal Loan').count()

                 ID   Age  Experience  ...  CD Account  Online  CreditCard
Personal Loan                          ...
0              4520  4520        4520  ...        4520    4520        4520
1               480   480         480  ...         480     480         480

[2 rows x 13 columns]

In [ ]:
A= dataset.isnull().values.any()
print(A)

False

In [ ]:
dataset.describe()

                ID          Age  ...       Online   CreditCard
count  5000.000000  5000.000000  ...  5000.000000  5000.000000
mean   2500.500000    45.338400  ...     0.596800     0.294000
std    1443.520003    11.463166  ...     0.490589     0.455637
min       1.000000    23.000000  ...     0.000000     0.000000
25%    1250.750000    35.000000  ...     0.000000     0.000000
50%    2500.500000    45.000000  ...     1.000000     0.000000
75%    3750.250000    55.000000  ...     1.000000     1.000000
max    5000.000000    67.000000  ...     1.000000     1.000000

[8 rows x 14 columns]

In [ ]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 14 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  5000 non-null   int64
 1   Age                 5000 non-null   int64
 2   Experience          5000 non-null   int64
 3   Income              5000 non-null   int64
 4   ZIP Code            5000 non-null   int64
 5   Family              5000 non-null   int64
 6   CCAvg               5000 non-null   float64
 7   Education           5000 non-null   int64
 8   Mortgage            5000 non-null   int64
 9   Personal Loan       5000 non-null   int64
 10  Securities Account  5000 non-null   int64
 11  CD Account          5000 non-null   int64
 12  Online              5000 non-null   int64
 13  CreditCard          5000 non-null   int64
dtypes: float64(1), int64(13)
memory usage: 547.0 KB

In [ ]:
df = df.drop(['ID'],axis=1)
df.head()

   Age  Experience  Income  ...  CD Account  Online  CreditCard
0   25           1      49  ...           0       0           0
1   45          19      34  ...           0       0           0
2   39          15      11  ...           0       0           0
3   35           9     100  ...           0       0           0
4   35           8      45  ...           0       0           1

[5 rows x 13 columns]

In [ ]:
df.shape

(5000, 13)

In [ ]:
duplicate_rows_df = df[df.duplicated()]
print("number of duplicate rows: ", duplicate_rows_df.shape)

number of duplicate rows:  (0, 13)

In [ ]:
from sklearn import preprocessing
# use scaling

In [ ]:
df.describe()

               Age   Experience  ...       Online   CreditCard
count  5000.000000  5000.000000  ...  5000.000000  5000.000000
mean     45.338400    20.104600  ...     0.596800     0.294000
std      11.463166    11.467954  ...     0.490589     0.455637
min      23.000000    -3.000000  ...     0.000000     0.000000
25%      35.000000    10.000000  ...     0.000000     0.000000
50%      45.000000    20.000000  ...     1.000000     0.000000
75%      55.000000    30.000000  ...     1.000000     1.000000
max      67.000000    43.000000  ...     1.000000     1.000000

[8 rows x 13 columns]

In [ ]:
Q1 = df.quantile(0.25)
Q3 = df.quantile(0.75)
IQR = Q3 - Q1
print(IQR)

Age                     20.0
Experience              20.0
Income                  59.0
ZIP Code              2697.0
Family                   2.0
CCAvg                    1.8
Education                2.0
Mortgage               101.0
Personal Loan            0.0
Securities Account       0.0
CD Account               0.0
Online                   1.0
CreditCard               1.0
dtype: float64

In [ ]:
print(df['Income'].skew())
df['Income'].describe()

0.8413386072610816

count    5000.000000
mean       73.774200
std        46.033729
min         8.000000
25%        39.000000
50%        64.000000
75%        98.000000
max       224.000000
Name: Income, dtype: float64

In [ ]:
print(df['Mortgage'].skew())
df['Mortgage'].describe()

2.1040023191079444

count    5000.000000
mean       56.498800
std       101.713802
min         0.000000
25%         0.000000
50%         0.000000
75%       101.000000
max       635.000000
Name: Mortgage, dtype: float64

In [ ]:
print(df['Experience'].skew())
df['Experience'].describe()

-0.026324688402384513

count    5000.000000
mean       20.104600
std        11.467954
min        -3.000000
25%        10.000000
50%        20.000000
75%        30.000000
max        43.000000
Name: Experience, dtype: float64

In [ ]:
print(df['CCAvg'].skew())
df['CCAvg'].describe()

1.598456618052042

count    5000.000000
mean        1.937913
std         1.747666
min         0.000000
25%         0.700000
50%         1.500000
75%         2.500000
max        10.000000
Name: CCAvg, dtype: float64

In [ ]:
print(df['ZIP Code'].skew())
df['ZIP Code'].describe()

-12.500221098132892

count     5000.000000
mean     93152.503000
std       2121.852197
min       9307.000000
25%      91911.000000
50%      93437.000000
75%      94608.000000
max      96651.000000
Name: ZIP Code, dtype: float64

In [ ]:
print("income skewness value",df['Income'].skew()) #					CD Account		
print("experience skewness value",df['Experience'].skew())
print("age skewness value",df['Age'].skew())
print("Zip code skewness value",df['ZIP Code'].skew())
print("family skewness value",df['Family'].skew())
print("ccavg skewness value",df['CCAvg'].skew())
print("education skewness value",df['Education'].skew())
print("personal loan skewness value",df['Personal Loan'].skew())
print("securities account skewness value",df['Securities Account'].skew())
print("online skewness value",df['Online'].skew())
print("cd account skewness value",df['CD Account'].skew())
print("credit card skewness value",df['CreditCard'].skew())

income skewness value 0.8413386072610816
experience skewness value -0.026324688402384513
age skewness value -0.02934068151284029
Zip code skewness value -12.500221098132892
family skewness value 0.15522066944367582
ccavg skewness value 1.598456618052042
education skewness value 0.22709331566088503
personal loan skewness value 2.743606655894059
securities account skewness value 2.588268372959341
online skewness value -0.3947853269234487
cd account skewness value 3.6917137984151887
credit card skewness value 0.9045894514231758